IDENTIFICATION DIVISION.
       PROGRAM-ID. EVALUATEBUG.
       PROCEDURE DIVISION.
           EVALUATE THAT
               WHEN 'A'
               WHEN 'B'
                  CONTINUE
               WHEN 'C'
                  CONTINUE
           END-EVALUATE.
